/*Задача 1
Объявите две переменные: admin и name.
Запишите строку "Джон" в переменную name.
Скопируйте значение из переменной name в admin.
Выведите на экран значение admin, используя функцию alert (должна показать «Джон»).
*/
let name, admin;
name = 'Джон';
admin = name;
console.log(admin);

/*Задача 2
Создайте переменную для названия нашей планеты. Как бы вы её назвали?
Создайте переменную для хранения имени текущего посетителя сайта. Как бы вы назвали такую переменную?
*/
let planetName = 'Planet';
let currentUserName = 'Name';

/*Задача 3
Какие буквы (заглавные или строчные) использовать для имён констант?
const birthday = '18.04.1982'; - it`s ok
const age = someCode(birthday); - nope
*/
